import { Question } from '@/types/career';

export const QUESTIONS: Question[] = [
  {
    number: 1,
    text: "אני חולם שאני כל כך טוב במה שאני עושה, שאנשים יבואו אליי עם בעיות ויזדקקו לי מאוד.",
    anchor: "TF"
  },
  {
    number: 2,
    text: "יש לי סיפוק גדול ביותר מעבודתי, כאשר אני מצליח להשפיע על החלטות החשובות של הארגון.",
    anchor: "GM"
  },
  {
    number: 3,
    text: "אני חולם על קריירה שתאפשר לי חופש פעולה במסגרת העבודה, ולא תכתיב לי איך לעשות דברים.",
    anchor: "AU"
  },
  {
    number: 4,
    text: "ביטחון ויציבות חשובים לי יותר מאשר חופש ועצמאות.",
    anchor: "SE"
  },
  {
    number: 5,
    text: "אני תמיד מחפש רעיונות שיאפשרו לי להקים עסק משלי.",
    anchor: "EC"
  },
  {
    number: 6,
    text: "ארגיש כ\"מצליחן\" בקריירה שלי רק אם אהיה סבור שהיא תרמה במשהו לעולם או לחברה.",
    anchor: "SV"
  },
  {
    number: 7,
    text: "אני חולם על קריירה בה אוכל לפתור בעיות או לבצע משימות כמעט בלתי אפשריות.",
    anchor: "CH"
  },
  {
    number: 8,
    text: "אעדיף לעזוב את מקום עבודתי מאשר לבצע תפקיד שישבש לי את אורח חיי הפרטי.",
    anchor: "LS"
  },
  {
    number: 9,
    text: "ארגיש כ\"מצליחן\" בקריירה שלי רק אם אוכל לפתח את המומחיות שלי בתחום מקצועי.",
    anchor: "TF"
  },
  {
    number: 10,
    text: "אני חולם לנהל ארגון מורכב ולקבל החלטות משמעותיות שישפיעו עליו.",
    anchor: "GM"
  },
  {
    number: 11,
    text: "אני שבע רצון ביותר מהעבודה שלי כאשר אני חופשי לפעול בדרכי.",
    anchor: "AU"
  },
  {
    number: 12,
    text: "אעדיף לפרוש מהאירגון מאשר לקבל על עצמי תפקיד שאינו קבוע.",
    anchor: "SE"
  },
  {
    number: 13,
    text: "להקים עסק משלי חשוב לי יותר מאשר לקבל משרת ניהול בכירה.",
    anchor: "EC"
  },
  {
    number: 14,
    text: "אני מסופק ביותר בקריירה שלי כאשר אני יכול לעזור לאחרים.",
    anchor: "SV"
  },
  {
    number: 15,
    text: "ארגיש כ\"מצליחן\" בקריירה שלי רק אם אעמוד בפני אתגרים קשים במיוחד ואפתור אותם.",
    anchor: "CH"
  },
  {
    number: 16,
    text: "אני חולם על קריירה שתאפשר לי לשלב את דרישות העבודה עם חיי האישיים.",
    anchor: "LS"
  },
  {
    number: 17,
    text: "מושך אותי יותר להתמנות כמנהל בכיר בתחום הטכני מאשר לנהל ארגון גדול.",
    anchor: "TF"
  },
  {
    number: 18,
    text: "ארגיש כ\"מצליחן\" בקריירה שלי רק אם אתמנה למשרה בכירה מאוד בתחום הניהול.",
    anchor: "GM"
  },
  {
    number: 19,
    text: "ארגיש כ\"מצליחן\" בקריירה שלי רק אם אשיג עצמאות מלאה בעבודתי.",
    anchor: "AU"
  },
  {
    number: 20,
    text: "אני מחפש עבודה בקרב ארגונים שנותנים לי תחושת קביעות ויציבות.",
    anchor: "SE"
  },
  {
    number: 21,
    text: "אני שבע רצון ביותר מהקריירה שלי כשאני מצליח ליזום משהו חדש.",
    anchor: "EC"
  },
  {
    number: 22,
    text: "ניצול הידע המקצועי שלי כדי לגרום לעולם להיות טוב יותר חשוב לי מאוד.",
    anchor: "SV"
  },
  {
    number: 23,
    text: "נגרם לי הסיפוק הגדול ביותר בקריירה שלי כשהצלחתי להתמודד עם אתגר אדיר.",
    anchor: "CH"
  },
  {
    number: 24,
    text: "אני מרגיש שאני מצליח בחיים רק כאשר אני יכול לשלב היטב בין העבודה לבין החיים האישיים.",
    anchor: "LS"
  },
  {
    number: 25,
    text: "אעדיף לפרוש ממקום עבודתי מאשר לקבל משרה שתאלץ אותי לזנוח את התחום המקצועי שלי.",
    anchor: "TF"
  },
  {
    number: 26,
    text: "להתמנות כמנכ\"ל מושך אותי יותר מאשר להיות מומחה בכיר בתחום טכני.",
    anchor: "GM"
  },
  {
    number: 27,
    text: "ההזדמנות לבצע את העבודה בדרך שלי, ללא הוראות מגבוה, חשובה לי מאוד.",
    anchor: "AU"
  },
  {
    number: 28,
    text: "אני הכי מרוצה מעבודתי כשיש לי תחושה של ביטחון תעסוקתי יציב לאורך זמן.",
    anchor: "SE"
  },
  {
    number: 29,
    text: "ארגיש כ\"מצליחן\" בקריירה שלי רק אם אוכל ליצור משהו חדש משל עצמי.",
    anchor: "EC"
  },
  {
    number: 30,
    text: "אני חולם על קריירה שיש בה תרומה ממשית לאנשים, לקהילה או לעולם.",
    anchor: "SV"
  },
  {
    number: 31,
    text: "אני מחפש הזדמנויות תעסוקה המהוות אתגר גדול מאוד שדורש את מיטב היכולות שלי.",
    anchor: "CH"
  },
  {
    number: 32,
    text: "היכולת לאזן בין חיי האישיים והמקצועיים חשובה לי יותר מקידום או כסף.",
    anchor: "LS"
  },
  {
    number: 33,
    text: "אני הכי שבע רצון מעבודתי כאשר אני יכול לנצל את כישוריי המקצועיים לעומק.",
    anchor: "TF"
  },
  {
    number: 34,
    text: "אעדיף לפרוש ממקום עבודתי מאשר לקבל עבודה שאינה בתפקיד ניהולי.",
    anchor: "GM"
  },
  {
    number: 35,
    text: "אעדיף לפרוש ממקום עבודתי מאשר לקבל עבודה שאינה מאפשרת לי עצמאות מוחלטת.",
    anchor: "AU"
  },
  {
    number: 36,
    text: "אני חולם על קריירה שתיתן לי הרגשה של ביטחון כלכלי ותעסוקתי.",
    anchor: "SE"
  },
  {
    number: 37,
    text: "אני חולם להקים עסק משלי.",
    anchor: "EC"
  },
  {
    number: 38,
    text: "אעדיף לפרוש ממקום עבודתי מאשר לקבל על עצמי תפקיד שלא תורם לאחרים.",
    anchor: "SV"
  },
  {
    number: 39,
    text: "לטפל בבעיות שכמעט ולא ניתן לפותרן חשוב לי יותר מכל קידום או תואר.",
    anchor: "CH"
  },
  {
    number: 40,
    text: "תמיד חיפשתי לי תפקידים שישבשו כמה שפחות את שגרת חיי האישיים.",
    anchor: "LS"
  }
];